[
  {
    "title": "Show, Don't Tell",
    "content": "Instead of stating a character's emotion, describe their actions and physical reactions. For example, instead of 'He was angry', write 'He clenched his fists and his face turned red'."
  },
  {
    "title": "Active Voice",
    "content": "Use the active voice to make your sentences stronger and more direct. In active voice, the subject performs the action. Passive: 'The ball was thrown by the boy.' Active: 'The boy threw the ball.'"
  },
  {
    "title": "Vary Sentence Length",
    "content": "Mix short and long sentences to create rhythm and keep the reader engaged. Short sentences add punch. Long sentences add flow."
  },
  {
    "title": "Avoid Adverbs",
    "content": "Strong verbs are better than weak verbs with adverbs. Instead of 'ran quickly', use 'sprinted'. Instead of 'said loudly', use 'shouted'."
  },
  {
    "title": "Kill Your Darlings",
    "content": "Be willing to cut scenes or characters that don't serve the story, even if you love them. Every element must advance the plot or reveal character."
  },
  {
    "title": "Let's compile a comprehensive list of resources for writers",
    "content": "I thought it might be a good idea to have a list of websites, blogs, books, podcasts, software, twitter feeds, etc., for writing resources . If you have anything to add to the list, please comment below. Here is my offering to the r / writing gods: Podcasts: Writing Excuses Self-Publishing Podcast Critiquecast The Creative Penn Rocking Self-Publishing Podcast Dead Robots Society Grammar Girl"
  },
  {
    "title": "Resources to plan and keep track of your writing : r/writing",
    "content": "Hi! I've been looking for some good resources for planning and keeping track of your writing . Just because it comes in handy, but also for that extra bit of motivation. Do you guys have any tips?"
  },
  {
    "title": "Where do you go to improve your writing skills? : r ... - Reddit",
    "content": "Where do you go to improve your writing skills? : r/writing Skip to main contentWhere do you go to improve your writing skills? : r/writing Open menu Open navigationGo to Reddit Home Image 1: r/writing icon Go to writing r/writing Where do you go to improve your writing skills? I know people say you dont have to go to college to gain a skill in creative writing so what would you do instead? Best resources for improving writing skills Apps for improving writing skills New to Reddit? * Reddit reReddit: Top posts of September 26, 2023 * * * * Reddit reReddit: Top posts of September 2023 * * * * Reddit reReddit: Top posts of 2023 * * *"
  },
  {
    "title": "What are some of your favourite writing exercises? - Reddit",
    "content": "Set a timer for 20-30 minutes, put some music in the background, or light a scented candle, or have a little snack before starting, or think of a feeling, or a random word as a starting point then get the timer going and start writing without thinking and worrying about punctuation, verbs, nothing at all, just a stream of conscience born off of what that music, that scent, that taste, that"
  },
  {
    "title": "Is Anyone Aware of Any Writing Resources that Focus *Specifically on...",
    "content": "The site owner hides the web page description."
  },
  {
    "title": "What *actually* helps you improve your writing? : r/writing",
    "content": "367 votes, 151 comments. Creative writing MFAs? Local writing workshop? Reading as much as you can? Practice, practice, practice? What makes you a"
  },
  {
    "title": "I've written over 30 books and want to share some tips",
    "content": "Just to give a little background before I get into my tips: I started writing in 2016 and jumped into the process with self-publishing. Since then, I have been writing on a pace of probably one 45,000 to 65,000 word book every 5 to 6 weeks. I've also been fortunate enough to carve out a really successful career in the process. My first four books made me a combined $7000 or so in the sci-fi"
  },
  {
    "title": "The 22 Best Writing Tips Ever | Writing Forward",
    "content": "This one dates back to 2007, but its still one of the most-visited posts on the blog and one of my favorites. I hope you enjoy these writing tips and find them useful!"
  },
  {
    "title": "21 Ways to Improve Your Writing | Writing Forward",
    "content": "The tips are important notes to consider by any writer . Most importantly, transition also plays an important role in keeping readers glued to a writer s pages. We keep learning."
  },
  {
    "title": "Writing Tips : Be Yourself | Writing Forward",
    "content": "In life and in writing : be yourself. As writers , we strive to connect with a reading audience. After all, writing is all about communication."
  },
  {
    "title": "How to Improve Your Writing Skills | Writing Forward",
    "content": "Better writing doesn't happen overnight. By cultivating good habits and applying yourself to the craft, you'll acquire the writing skills you need to succeed.Editing Tips for Writers ."
  },
  {
    "title": "Writing Tips | Learning Centers",
    "content": "1 day ago Learn the secrets to writing a compelling and memorable personal statement that will get you noticed and listen to our podcast about why you should avoid using childhood anecdotes."
  },
  {
    "title": "25 Tips for Writing",
    "content": "Study the current punctuation standards. When proofreading, say each sentence aloud, working from the final sentence to the first. Write the truth as you experience ityour truth. And be transparent about it. Remember that ultimately, writing is more a conversation than a performance."
  },
  {
    "title": "Tips for Strong Writing - Utah State University",
    "content": "A narrow essay focus leads to more meaningful examples, connections, and main ideas. The length of the paper can help approximate how many main ideas should be included. Total main ideas needed for a paper = 2 x (# of pages needed 1). For example, a 4-page paper needs an introduction, conclusion, and ~6 main ideas/paragraphs. Writing.usu.edu Anchor main ideas with topic Statements. Each paragraph should develop just one main idea! Put the main idea in the first sentence of the paragraph. - Try to connect the paragraphs main idea to the papers thesis. Tips: -Take time to revise the thesis, organization, arguments, research, and main ideas before tackling grammar. - Explain your thesis and main ideas to a friend."
  },
  {
    "title": "Essay Writing Tips - California State University, Fullerton",
    "content": "Writing the Conclusion A conclusion works to remind your reader of the main points of your paper and summarizes what you want your reader to take away from your discussion. Consider these tips when writing your conclusion: Begin with your rephrased thesis statement"
  },
  {
    "title": "Tips & Tools The Writing Center University of North Carolina ...",
    "content": "# Tips & Tools ## Writing the Paper * AI in Academic Writing * College Writing * Comparing/Contrasting Video * Outlines Video * Reading Aloud Video * Reverse Outlining Video * Understanding Assignments Video * Webbing Video * Writing Anxiety * Writing as Decision-Making Video * Writing Groups ## Citation, Style, and Sentence Level Concerns * Citation Resources * Conciseness Video * How We Cite Video * Passive Voice Video * Proofreading Video * Why We Cite Video ## Specific Writing Assignments or Contexts * Group Writing * Literature Reviews ## Writing for Specific Fields * Communication Studies * History ## Additional Resources * Fall 2025 At-A-Glance (Word) (PDF) * Summer 2026 At-A-Glance (Word) (PDF) * Library Resources"
  },
  {
    "title": "Academic Writing Introduction - Purdue OWL",
    "content": "This resource presents methods for adding sentence variety and complexity to writing that may sound repetitive or boring. Sections are divided into general tips for varying structure, a discussion of sentence types, and specific parts of speech which can aid in sentence variety."
  },
  {
    "title": "Strategies for Essay Writing - Harvard College Writing Center",
    "content": "[Skip to main content arrow_circle_down]( [Faculty of Arts and Sciences Harvard College Writing Center]( [Faculty of Arts and Sciences Harvard College Writing Center]( * [Tutoring]( expand_more * [Departmental Writing Fellows]( * [Drop-in Hours]( * [English Grammar and Language Tutor]( * [Senior Thesis Tutoring]( * [Writing Resources]( Resources expand_more * [Strategies for Essay Writing]( * [Brief Guides to Writing in the Disciplines]( * [Writing Advice: The Barker Underground Blog]( * [Meet the staff]( * [Contact/Employment]( 1. [Home]( 2. [Writing Resources]( * [Strategies for Essay Writing]( \"Strategies for Essay Writing\") * [Thesis]( \"Thesis\") * [Introductions]( \"Introductions\") * [Transitions]( \"Transitions\") * [Counterargument]( \"Counterargument\") * [Conclusions]( \"Conclusions\") * [Brief Guides to Writing in the Disciplines]( \"Brief Guides to Writing in the Disciplines\") [Admin login]("
  },
  {
    "title": "A Short Guide to Academic Writing Style - Duke University",
    "content": "The strategies will help ensure the writing is suitable for an academic audience and minimize distractions for readers accustomed to academic writing conventions. Although we may more commonly say to quickly run, the preferred use in academic writing is to write to run quickly. Split infinitives are actually grammatically correct, but the general academic convention is to avoid them. (See Resources below.) Many first-year students face challenges adjusting to the academic writing that university professors expect. Helpful Online Resources Passive and active voice handout: Using first person effectively: Citations reference from Duke Libraries website: Proofreading for common grammatical mistakes: Numerous strategies for revising: Reading aloud:"
  },
  {
    "title": "What Is Plot? The 6 Elements of Plot and How to Use Them",
    "content": "Finally, you'll learn the six elements of plot that make stories entertaining and memorable. Plot is a sequence of events in a story in which the main character is put into a challenging situation that forces them to make increasingly difficult choices, driving the story toward a climactic event and resolution. Lets look at a few examples of plot elements at work in two well-known stories. **Need more plot help?** After you work on practicing this story structure in the exercise section below, check out my new book *The Write Structure* which helps writers make their plot better and write books readers love. Take one of the components of plot (exposition, inciting incident, rising action, climax, denouement), and show that point in your story."
  },
  {
    "title": "How to Use Three-Act Structure to Write a Story Readers Can't Put...",
    "content": "# How to Use Three-Act Structure to Write a Story Readers Cant Put Down Today, we'll look at another model you can use to write stories that actually work: 3-Act Story Structure. The beginning sets up the characters and problem, the middle is marked by a story beat or action that forces the main character to act in pursuit of a goal, and the end resolves the dilemma and drama. When writers apply the Three-Act Structure like followed in *The Hunger Games*, they produce a story with clear goals and stakes that force a main character to make crisis decisions that challenge and evolve their worldview."
  },
  {
    "title": "Tragedy Story Structure in the 7 Basic Plots",
    "content": "Today we look at tragedy story structure and examples. This post is part of our series exploring Christopher Bookers theory of plot types in The Seven Basic Plots: Why We Write Stories. See our overview, overcoming the monster plot. the rags to riches plot, the quest plot, the voyage and return plot, the rebirth plot, tragedy, and comedy."
  },
  {
    "title": "Freytag's Pyramid: Examples of the 5 Elements for this Classic...",
    "content": "We'll also look at how to use Scapple, a great piece of book writing software, to structure your stories based on Freytag's Pyramid. So while Freytags Pyramid certainly can be helpful for writers, especially those writing tragedy, his framework is much less universal than The Write Structure, *Story Grid*, or even *Save the Cat*, all of which better describe a wider variety of stories. | Freytags Pyramid (circa 1863) | 6 Modern Plot Points\\* | The Write Structure | ## How to Use Scapple to Plot and Structure Your Story with Freytags Pyramid To give you a sense of how to use Scapple to structure the plot of *your* story, here's a video demoing Scapple by plotting Romeo and Juliet using Freytags Pyramid:"
  },
  {
    "title": "7 Basic Plots, Endless Possibilities: A Writers Manual",
    "content": "It's because most of them follow a similar structure or plot pattern. Christopher Booker's The Seven Basic Plots is an analysis of stories based on Jungian psychology."
  },
  {
    "title": "How to Plot a Short Story Using Ideas and Structure",
    "content": "When I first started out writing short stories, I had no idea where I was going with any of them. Planning out your story, even if it's short, can give you an answer to this question. If the answer to all these questions is yes, then you most likely have a finishable story. How Asking This Question Can Plot a Short Story In the last post, I told you my favorite way to think of a short story idea is the What If? question. Knowing the answer to your What If? question is the most basic outline of a story. Weve got two important elements of the story narrowed down now: the What If? question and its ultimate answer."
  },
  {
    "title": "How to Shape a Story: The 6 Types of Story Arcs for Powerful ...",
    "content": "## Story Arcs Rise and Fall ## Story Arcs Measure Values For example, in an adventure story (Man in the Hole arc) set in space like the film *Gravity*, where the core value is physiological survival, you would measure the arc based on this life vs. The storys arc is created through this rise and fall movement. Now that you understand the six main arcs and how the shapes of stories interact with a storys core value, how do you actually use this information to write great stories? 2. Write a six-sentence story based on that arc using the six elements of dramatic structure: exposition, inciting incident, rising action, crisis, climax, and resolution."
  },
  {
    "title": "How to Shape a Story : The 6 Types of Story Arcs for Powerful...",
    "content": "## Story Arcs Rise and Fall ## Story Arcs Measure Values For example, in an adventure story (Man in the Hole arc) set in space like the film *Gravity*, where the core value is physiological survival, you would measure the arc based on this life vs. Now that you understand the six main arcs and how the shapes of stories interact with a storys core value, how do you actually use this information to write great stories? 2. Write a six-sentence story based on that arc using the six elements of dramatic structure: exposition, inciting incident, rising action, crisis, climax, and resolution."
  },
  {
    "title": "The Write Practice: Helping Writers Get Better Since 2011",
    "content": "Want to become a writer ? We turn aspiring writers into published authors through deliberate practice. Get our 10-step guide that's helped 100,000+ writers (and get started on your writing"
  },
  {
    "title": "5 Smooth Tricks to Make Your Writing Flow - The Write Practice",
    "content": "How do you make your writing flow, so each line and idea leads smoothly into the next? These five techniques will give you the word-by-word secrets of flow."
  },
  {
    "title": "7 Inspiring Writing Tips From On Writing Well",
    "content": "Ive had the book *On Writing Well: The Classic Guide to Writing Nonfiction*by William Zinsser on my shelf since my pre-law school journalism days. If you find that writing is hard, its because it is hard. William Zinsser Write in the first person, if you can. ## Writing Well Takes Practice There's always room to grow as a writer, and I love that *On Writing Well* outlines major ways we can all grow. Take fifteen minutes to write about what you do for a living, keeping Zinssers tips in mind. I try to write every day. Its also worse when its in front of a room full of people you work with. Book Writing Tips & Guides Best Book Writing Software Writing Teacher Resources"
  },
  {
    "title": "10 Essential Tips to Improve Your Writing Style",
    "content": "Write definite assertions. 8. Use Definite, Specific Concrete Language. Words that are general, vague or abstract are unlikely to hold the reader's attention. 7. Write With Nouns and Verbs."
  },
  {
    "title": "5 Writing Style Tips to Make Your Writing Stronger",
    "content": "Thats because they all work together to accomplish clear and compelling prose. The Road to Stronger Writing . Ready for the five writing style tips ? Here we go: 1. Use economy."
  },
  {
    "title": "A Guide to Story Structures | NY Book Editors",
    "content": "A story structure is a framework you use to organize your narrative. You can build a story in any way you choose; start with the beginning or the ending."
  },
  {
    "title": "Does the Shape of Your Plot Matter? | NY Book Editors",
    "content": "Understanding classic three-act structure could be the road map to strengthening your next story . Beginning, middle and end."
  },
  {
    "title": "How to Balance Characters With Plot | NY Book Editors",
    "content": "* Services + Editorial Services * Blog Back to blog In this post, well focus on three of those elements (character, plot, and conflict), and how each one influences the other. Subscribe to receive this extra resource. For some of us, an event inspires a story. ***/Spoiler/** Think George Orwells Nineteen Eighty-Four where the protagonists internal goal for independence is squelched by the Orwells goal to warn readers of the dangers of totalitarianism. The story should not move the characters like chess pieces. ## Additional Resources Looking for additional help to set up your story? Subscribe to receive this extra resource. Would you like to know how to sell more books? Heres what you need to know about both to create a stronge..."
  },
  {
    "title": "Heres a Beginners Guide to Writing a Historical | NY Book ...",
    "content": "Heres how to write a historical fiction story without losing your mind. Start By Reading Before you start your first draft, before you outline, and before you even think too closely about the story youre going to write read. Read books in the historical fiction genre."
  },
  {
    "title": "Why less planning could mean more for your next story .",
    "content": "Why do you love the stories you love? Indian Camp by Ernest Hemingway is one of my favorites. Its a concise narrative that raises big issues about death, gender, and coming of age."
  },
  {
    "title": "Character Development | NY Book Editors",
    "content": "This post talks tips on writing stronger characters to make your reader more invested in the story."
  },
  {
    "title": "Character | NY Book Editors",
    "content": "9 Character Development Techniques You Need to Know. Looking for ways to write more rounded characters for your story? In todays post, we look at top techniques for develop"
  },
  {
    "title": "How to Write Stronger Characters | NY Book Editors",
    "content": "* Services + Editorial Services * Blog Back to blog They may not always make the right choices, but they always make the best story. While you may not need to share all of your character's backstory with the reader, you must know where the character comes from and how their past experiences will influence their future choices. Humans are also self-motivated. Even the best of us have private struggles and the tendency to act out of fear. How do you give a character a flaw? This inability to act in ones best interest and instead act in ones ***immediate*** interest is a flaw of realistic characters. Make sure you document how your characters grow, even if the growth is minuscule."
  },
  {
    "title": "Character Development: How to Create a Consistent Voice",
    "content": "Character development begins with voice. By understanding what someone says to themselves and how they choose to verbalize their internal dialogue, you can create a realistic and dependable character ."
  },
  {
    "title": "Additional Resources for Secondary",
    "content": "Character Development .3. 4 Tips for Writing Round Characters . 4. How to Develop a Character for a Story."
  },
  {
    "title": "9 Easy Hacks to Make You a Better Writer | NY Book Editors",
    "content": "Speaking of which, make sure that you download our curated list of epic writing hacks. Implement all of these tips to help you become a better writer immediately."
  },
  {
    "title": "Tips to Improve Your Fiction Writing | NY Book Editors",
    "content": "Hey, we have even more writing tips here. Check out this expanded list of 15 more ways to become a better fiction writer here."
  },
  {
    "title": "How to Be a More Productive Writer | NY Book Editors",
    "content": "It may seem like a weird tip to include in a post about writing productivity, however, reading actually helps you become a better writer in the following ways"
  },
  {
    "title": "Daily Writing Exercises Every Writer Needs | NY Book Editors",
    "content": "In this post, we look at the top daily writing exercises that will help you improve as a writer."
  },
  {
    "title": "The Five-Act Structure : The Foundation of an Engaging Story",
    "content": "The five-act structure is a plot template in which a story is divided into five sections. In general, the three-act structure tells a more linear story: beginning, middle, end. In a five-act structure, the plot tends to split into two distinct stories: the world before, and the world after. ## The five-act story structure, explained But because this is a story in five acts, the climax becomes the plots biggest turning point which sends the protagonist into a whole new adventure. Since Shakespearean plays are always a good example of act-based story structure, lets take a close look at one of literatures most renowned tragedies: Shakespeares *Romeo and Juliet*. ## How to apply the five-act structure to your own story"
  },
  {
    "title": "The Three-Act Structure : What It Is and How to Write It, with Examples",
    "content": "However, story structures give both new and experienced writers a way to make sure theyre hitting the right story beats and turning points in ways that will keep readers engaged from beginning to end. If you prefer to explore your story world as you go and discover new things through the writing process (a Pantser), you may find it more helpful to look at the three-act structure through the editing stage to help refine the pacing, character arc, and overall shape of your plot. If youre beginning a new story, try filling out each element of the three-act structure: exposition, inciting incident, first key plot point, rising action, midpoint, second key plot point, pre-climax, climax, and resolution."
  },
  {
    "title": "Story Outline - Free and Easy-to-Use Templates",
    "content": "formandtemplate. com has been visited by 100K+ users in the past month Download, print, and create high-quality Story Outline with our templates for free. Complete your Story Outline efficiently for free with our high-quality templates!"
  },
  {
    "title": "Story Structure Books - Read as Much as You Want",
    "content": "amazon. com has been visited by 1M+ users in the past month Browse the collection of literature, fantasy, suspense & other books at Amazon. Grab exciting deals & offers on amazing products & save your money."
  },
  {
    "title": "The 8 Point Story Arc: What It Is and How to Use This Story ...",
    "content": "While some story arcs only have three or four points (like three act structures), this eight point arc breaks your plot down into even more definable plot points, which can be very helpful if you find yourself struggling with knowing where to go next with writing your story. Whether or not youre a plotter, pantser, or somewhere in between, thinking about your eight-point arc before you begin writing can ensure that you keep your story on track, going where it needs to go (rather than letting your characters wander aimlessly, losing your readers attention in the process). These arcs do not need to be as complex as your storys overall, main plot, but they should still follow that arc-like shape of rising in action to a climax and then settling into a new normal at the end of the story."
  },
  {
    "title": "What is Plot? Definition, Examples & 10+ Types of Story Plots",
    "content": "## What is plot in a story? Every time a character makes a choice or reacts to the consequences of a choice, the plot of the story moves forward. The most important element of plot structure, a characters choices are what drive the story forward and encourage readers to empathise with their journey (well talk a bit more about the Heros Journey story archetype below). ### How to plot your story using the three act structure The storys climax is the emotional crux of the plot, for both the main character and the reader. Overlaid with the three-act structure, the plot of a story using the Heros Journey looks like this:"
  },
  {
    "title": "Story Archetypes: 50+ Plot Archetypes to Craft Your Narrative",
    "content": "**By finding the archetype that resonates most with the message youre trying to send, youll be able to shape the path your characters take in a way that readers will be ready to follow, to engage with, and to immerse in** because it puts them in the familiar landscape of other stories theyve loved. Also called the monomyth, the Heros Journey is one of our most common universal story archetypes. Unlike the Quest, the hero wont necessarily have a goal at the end of the road; these stories are about the journey, the people the hero meets, and the things they learn about themselves and their perception of the world along the way."
  },
  {
    "title": "The Parts of a Story: 10 Critical Elements of a Story Explained",
    "content": "Theres no one best point of view that will work for every single story; some will be more effective with an up-close-and-personal relationship to the main character, while others will benefit from some objectivity. First person subjective stories are told from the characters perspective using the pronoun I. The main character tells their story directly to the reader (or sometimes another person, through letters or diary entriesthis is called epistolary fiction). Third person omniscient point of view is the God perspective in which the reader can see the thoughts, feelings, beliefs, and experiences of every character in the story. ### Types of characters in a story The protagonist is the main character of a story."
  },
  {
    "title": "The Write Practice: Helping Writers Get Better Since 2011",
    "content": "Become a better creative writer with The Write Practice. Find the best lessons, get timed exercises, and then share your writing in our community to get feedback."
  },
  {
    "title": "Writing Advice From Ray Bradbury - The Write Practice",
    "content": "Writing Advice From Ray Bradbury The good news is, since every writer hits those times, you're following a well-worn path, and many great writers have left support and encouragement for you along the way. Now, I know you know the name Ray Bradbury."
  },
  {
    "title": "10 Essential Tips to Improve Your Writing Style",
    "content": "The advice in Elements of Style continues to provide sound advice for good writing . My husband serves as my critic for determining the clarity of my writing ."
  },
  {
    "title": "When You Should Be Writing But Can't, Do These 6 Things Instead",
    "content": "And yet sometimes, I need this advice . I can justify myself and explain my problem, but in the end, it doesn't matter. I was made to write and I need to do it, regardless of how I'm feeling."
  },
  {
    "title": "10 Writing Hacks to Actually Finish Your Book",
    "content": "If you don't write it, no one will. Write it down. To write a book, you need two kinds of deadlines: one for the date you'll finish the whole entire book, and a set of smaller deadlines to ensure you make progress week by week. I knew throughout my whole writing process that the book I wrote by my ultimate deadline may not be very good, but it would be finished. **If you want to write a book, you need a book writing process that works.** We've built these productivity hacks into the Write Plan Planner, the planner designed to help you finally *finish* your book. Why Do We Write? Why Do We Write?"
  },
  {
    "title": "How to Write a Book: The Ultimate Guide (with Free Book Idea ...",
    "content": "You want to write a book. Writing a book is hard. If you don't quit, if you just keep writing, keep following this process we've outlined above, you will finish a book. ## More Resources on How to Write a Book * How to Write a Book in 100 Days: 10 Steps * How to Write a Book in 100 Days * The First 10 Steps to Write Your Book in 2020 ### How to Write a Book by Genre * How to Write a Book When You Don't Have Ideas ### How to Write a Book and Publish It * How to Write and Publish a Book for Free Once you've finished writing a book, how do you get it published?"
  },
  {
    "title": "Screenwriting resources : r/Screenwriting - Reddit",
    "content": "Join our community of over 1,700,000 Screenwriters! From beginners to professionals, we come together to teach, learn, and share everything about Screenwriting. Please view our rules and wikis before posting. Scroll down for resources , mod and verification applications, and more."
  },
  {
    "title": "Resources for the non-beginner : r/Screenwriting - Reddit",
    "content": "This is incredible! It's also very cool some of my posts made it on here. The collection of writers you've included are among my favorite contributors to this subreddit. They no doubt help make r / Screenwriting the single best source out there for cutting-edge information on screenwriting and things that are interesting to screenwriters... Okay, second best one after Scriptnotes."
  },
  {
    "title": "r/Screenwriting - Reddit",
    "content": "Join our community of over 1,700,000 Screenwriters! From beginners to professionals, we come together to teach, learn, and share everything about screenwriting for film and television. Please view our rules and wikis before posting. Scroll down for resources , mod and verification applications, and more."
  },
  {
    "title": "Book recommendations : r/Screenwriting - Reddit",
    "content": "The Scripnotes episode \" How to Write A Movie\" is the best resource I've found for writing a screenplay. For micro-level, scene-work, have a look through the back catalogue of Scriptnotes for some Three Page Challenges. They critique the first three pages of amateur screenplays, and it's very useful in learning how to actually write good scenes. Really, all of Scriptnotes is extremely useful"
  },
  {
    "title": "Huge Dump Of Screenplay PDFs Along With Slightly ... - Reddit",
    "content": "This is a google drive link to a zip file of exactly 299 Screenplay PDFs (Updated link below). These are the scripts for some of the greatest movies of all time, along with a few of the greatest TV pilots of the last 20 years. I have spent time compiling them so you don't have to, though I suspect many of you may already have a lot of these"
  },
  {
    "title": "How to Break into Hollywood, from with no resources other ...",
    "content": "How to Break into Hollywood, from with no resources other than dedication to do whatever it takes. (3 part question)."
  },
  {
    "title": "WriterSolo (file-based version of WriterDuet), official ...",
    "content": "In case you missed it... WriterSolo is the offline-only complement to WriterDuet. It has most of the same features (beautiful UI, infinite revision history, content filtering, compatibility with other programs, etc.) without WD's collaboration and real-time syncing. Besides account management (initial login, changing your name/subscription, etc.), WS does not sync to WD's private cloud, but WS"
  },
  {
    "title": "How to Become a Successful Writer ... - WRITERS HELPING WRITERS",
    "content": "Books on writing can give you a huge leg up. Blog posts are bite-sized gems packed with advice . Join a writer s group, get involved in forum discussions, and take a workshop for a spin."
  },
  {
    "title": "Resources for Fiction Writers : Tools, Advice & Expert Help",
    "content": "Top writing tools, expert advice , and trusted resources for fiction authorsplus game-changing tools from Writers Helping Writers and One Stop for Writers ."
  },
  {
    "title": "Struggling with (and Regaining)... - WRITERS HELPING WRITERS",
    "content": "Writing is hard. Angela & Becca make it easier. Get ready to level up your fiction with game-changing tools, resources, and advice ."
  },
  {
    "title": "Awesome Writing Tips From... - WRITERS HELPING WRITERS",
    "content": "I think my favorite piece of writing advice ever comes from Steinbeck: Abandon the idea that you are ever going to finish. Lose track of the 400 pages and write just one page for each day"
  },
  {
    "title": "Writers Helping Writers | Resources to Elevate Your Fiction",
    "content": "Published Time: Sat, 20 Sep 2025 03:11:31 GMT Writers Helping Writers | Resources to Elevate Your Fiction **Planning to write 50K this November? * Skip to primary navigation * Skip to main content * About WHW * Master Storytelling Newsletter * Free Thesaurus Sampler * WHW Descriptive Thesaurus Collection sign up for our newsletter Email Address* This site has many one-of-a-kind tools and resources for writers, editors and teachers, so we encourage you to poke around. How To Push Past The Fear of Never Getting Published NO AI TRAINING: Any use of this content to train generative artificial intelligence (AI) technologies to generate text is expressly prohibited. Write a Comment..."
  },
  {
    "title": "How to Use Show, Dont Tell to Strengthen Your Story",
    "content": "Mar 25, 2025 Show, Don't Tell is iconic writing advice for a reason, but it can be used for more than showing emotion. Check out these helpful examples!"
  },
  {
    "title": "The Ultimate Guide for Giving and Receiving Feedback",
    "content": "For this to work, a person must respect the others role, value the time and energy writing and critiquing takes, and follow through without letting emotions overrun good judgment or manners. * **Before you read the critique, remind yourself that the reason you asked for feedback was to make the story stronger.** Set the expectation that you will have work to do, and ultimately the story benefits. * **\\*\\*Respect the Critique Partners time and effort****.** This person likely just spent several hours working on your submission, and regardless if you agree with the feedback or not, you should send a follow up email thanking them for the critique, highlighting how it gave you better insight into you story and characters."
  },
  {
    "title": "Michael Crichtons Method for Plotting Out a Story",
    "content": "May 27, 2014 One evening before class he told me: Dottie, you are good at telling a story, as well as writing natural dialogue . . . but people like you always have a problem with plotting. If you cannot master this, you will have to write with a partner! Michael Crichtons method for plotting out a story is what came to the rescue."
  },
  {
    "title": "Tips to Improve Your Fiction Writing | NY Book Editors",
    "content": "The best writers are avid readers. Write every day, whether you feel like it or not. Good writing isnt an accident. It comes from the daily discipline of sitting down and writing ."
  },
  {
    "title": "Planning To Outline Your Novel? Don't | NY Book Editors",
    "content": "Your writing isnt a house or a business meeting. It feels like work. It uses the same skills you use to email your boss. But your writing is art, and it doesnt need a prescription to succeed. When writers engage in extensive pre- writing in the form of outlines and character sketches, we change the job of the writing were preparing to do."
  },
  {
    "title": "8 Unusual Ways to Boost Your Writing Productivity | NY Book Editors",
    "content": "As a writer , youve probably experienced ebbs and flows in terms of writing productivity. Some days, no one can rip you away from your notebook or computer."
  },
  {
    "title": "9 Easy Hacks to Make You a Better Writer | NY Book Editors",
    "content": "But, writing down your inspiration on sticky notes and random scraps of paper you may find around your desk wont work. Sticky notes may seem like a good idea until youre covered in them."
  },
  {
    "title": "Better Characters , Faster : The Write Practice",
    "content": "Better Characters , Faster is a 2-part class designed to help you create your best characters ."
  },
  {
    "title": "Character Development Through Posture - The Write Practice",
    "content": "In the animation class I am taking, one of the first lessons on developing a character to animate, is to think about how the character stands. To develop the character through posture. How does your character stand? The animation class has helped me develop a character in a story by having to show the person's character in a drawing."
  },
  {
    "title": "How Characters Change in Stories (And How to Write Believable ...",
    "content": "They teach us how to overcome our own outer and inner conflicts vicariously through character development . And different characters , like people in real life, change in different ways."
  },
  {
    "title": "This Therapy Secret Will Transform Your Character Development",
    "content": "But what is a personality disorder? And how can you improve your character development by learning about them? In this episode of Character Test, I talk with a therapist about personality disorders, the psychology of character development , and how to handle conflict when it feels over the top and you dont know whats going on."
  },
  {
    "title": "Callie Sutcliffe on How to Develop Characters Readers Will Love",
    "content": "How do you start the process of character development ? Do you interview your characters or spend a lot of time on character questionnaires?"
  },
  {
    "title": "How to Use a Photo Shoot for Character Development",
    "content": "Today, we'll learn how visualizing a photo shoot will help you improve your character development .Perhaps you will find many of these questions helpful for character development ."
  },
  {
    "title": "The Strongest Form of Characterization",
    "content": "Characterization is the creation and development of a fictional character . In a story, you might see two types of characterization : direct characterization and indirect characterization ."
  },
  {
    "title": "The Strongest Form of Characterization",
    "content": "Feb 12, 2025 The characters feel like real people and we want to see their stories continue. Good, complex characters are why most people read, I think. However, in order to create a complex character readers want to be BFFs with, the characterization is secondary. Plot: How to Really Develop Your Characters In fiction, plot reveals key characters ."
  },
  {
    "title": "Got 15 Minutes? How to Write 500+... - WRITERS HELPING WRITERS",
    "content": "Watch yourself to see how often you are distracted and how many times you resist those distractions. Focus is a skill, much like playing a musical instrument or writing !"
  },
  {
    "title": "The Storyteller's Roadmap: Your... - WRITERS HELPING WRITERS",
    "content": "We show you how to get past these and provide a Writing Checklist so the words continue to flow. Of course, once the first draft is written , the real work begins."
  },
  {
    "title": "The Art of Skipping Around... - WRITERS HELPING WRITERS",
    "content": "**As you work on a first draft of a story (or other piece of writing), you focus on the sections youre most compelled to work on at that time.** So if youre struggling with Scene A but visualizing or feeling Scene B more strongly, you would skip to Scene B and return to Scene A later. Another benefit of writing non-sequentially is that **it helps you work around and even beat writers block.** By skipping to a section that puts up less resistance, youre not ignoring the part thats stalling your writing. I can understand how feeling like youre the only one who writes that way can make you feel less confident, so Im glad this post was able to give you a much-needed boost."
  },
  {
    "title": "Write a Novel in 13 Steps - WRITERS HELPING WRITERS",
    "content": "Nov 9, 2023 Writing an entire book is a huge undertaking, and youve just done it. Take some time to do something special read, relax, and reward yourself for having the persistence to see this through."
  },
  {
    "title": "How to Write Your First Book - WRITERS HELPING WRITERS",
    "content": "7 Tips for How to Write a Book When You Have No Idea What Youre Doing. Not knowing where to start is a problem countless writers before us have faced and figured out."
  },
  {
    "title": "Setting Yourself up for Success... - WRITERS HELPING WRITERS",
    "content": "Unfortunately though, writing is hard. Sometimes thrust-a-screwdriver-in-my-eye hard. So thinking about how to set ourselves up for success as we sit down to write is a smart thing to do."
  },
  {
    "title": "Heinlein's Rules of Writing ... - WRITERS HELPING WRITERS",
    "content": "Harvey Stanbroughs Series of Posts on Heinleins Rules Heinleins Rules: 5 Simple Business Rules for Writing , by Dean Wesley Smith Heinleins Rules for Writing and How to Break Them."
  },
  {
    "title": "How to Write Intense Scenes That Captivate Readers",
    "content": "# How to Write Intense Scenes That Captivate Readers Whether its a gripping fight, a romantic encounter that leaves hearts racing, or an emotional moment that hits readers hard, these scenes pull readers in and keep them hooked. By keeping the description tight and concentrating on the immediate stakes, you can make readers feel every hit and every moment of tension. Intense scenes are all about keeping readers hooked and evoking emotion. By focusing on pacing, sensory details, and character reactions, you can create scenes that stick with readers long after they finish the story. Too much purple prose and descriptive intensity can make a scene feel melodramatic, and that pulls readers out of the story."
  },
  {
    "title": "Want to Show Your Characters Pain? Heres Everything You ...",
    "content": "Oct 5, 2023 Don't miss this series on how to injure characters and write about their pain effectively. This is a treasure trove of show-don't-tell help!"
  },
  {
    "title": "Originality in Storytelling | Writing Forward",
    "content": "Most stories are built with universal structures , or they use elements that can be found in the plethora of stories that already exists. Thats why readers can often predict the outcome of a plot"
  },
  {
    "title": "Fiction Writing Exercises: Narrative Arcs - Writing Forward",
    "content": "Jan 19, 2023 Todays fiction writing exercise is an excerpt from my book, Story Drills: Fiction Writing Exercises. This one focuses on story structure and examines narrative arcs within stories and across multiple scenes and installments of a story."
  },
  {
    "title": "The Writer's Journey: A Must-Read for Storytellers | Writing Forward",
    "content": "Ive seen these claims made in books on the writing process and in books on story structure . The Writers Journey makes no such claims, but it does provide us with a story structure that"
  },
  {
    "title": "Storytelling Exercise: Three Acts | Writing Forward",
    "content": "Choose five stories youve read, and break them into three-act structures by identifying the setup, conflict, and resolution for each one. Summarize each act in just a few sentences. Practice"
  },
  {
    "title": "Story Drills: Fiction Writing Exercises - Writing Forward",
    "content": "It is rarely that I come across a book on writing fiction that has been so packed with information and exercises. At first, it felt quite daunting. The book is divided into sections covering characters, plot, setting, theme, structure , narrative, literary devices and narrative techniques, craft and process, and story scholarships."
  },
  {
    "title": "Storytelling Exercise: Plot Analysis - Writing Forward",
    "content": "Jun 21, 2022 This exercise explores one of the most important elements of any story: plot. Its called Plot Analysis. Enjoy! Plot Analysis Some readers think analyzing a plot takes the fun out of reading a story. They believe that if you reveal the inner workings and structure of a story, some of the magic and mystery will fade away."
  },
  {
    "title": "Whats the Story? Building Blocks for Fiction Writing ...",
    "content": "It covers basics such as character, plot, point of view, and setting but it also gets into deeper topics like theme, story structure , and even topic such as concept and premise. Catherine Lanser Read the full review of Whats the Story? Building Blocks for Fiction Writing at catherinelanser.com."
  },
  {
    "title": "42 Fiction Writing Tips for Novelists - Writing Forward",
    "content": "Mar 18, 2025 Over the years, I have compiled this grand list of fiction writing tips for authors. They come from classes, books, interviews, and personal experience."
  },
  {
    "title": "Characters - WRITERS HELPING WRITERS",
    "content": "Write characters that fascinate using these resources, character -building tools, articles & links. Everything you need is all in one place."
  },
  {
    "title": "Character Building: How Much... - WRITERS HELPING WRITERS",
    "content": "Minor characters require the least development of all. Focus on key personality points, behaviors, occupation, or skills that further the plot, and dont worry about the rest."
  },
  {
    "title": "Character Building: How Much... - WRITERS HELPING WRITERS",
    "content": "How deeply you need to plan depends on the character s role and importance, and the writers own comfort zone. Obviously a main character is going to need more development than a"
  },
  {
    "title": "5 Character Tools You Absolutely... - WRITERS HELPING WRITERS",
    "content": "# 5 Character Tools You Absolutely Need to Know Angela here, happy to welcome **Savannah Cordova** from Reedsy who has done some sleuthing to find tools that might help you create your characters. **TIP: Planning your characters personality using the database of positive traits and negative traits at One Stop for Writers is also a great option, as it helps you describe these traits through behaviors, attitudes, etc.** 1. [] storytellers creating their characters, Savannah Cordova shares 5 character tools you need to know about, Melissa Donovan investigates what makes iconic characters unforgettable, Jim Dempsey writes [] 2. [] 5 Character Tools You Need to Know | Writers Helping Writers [] 3. [] post 5 Character Tools You Absolutely Need to Know appeared first on WRITERS HELPING []"
  },
  {
    "title": "Using Backward Design to Plan Your... - WRITERS HELPING WRITERS",
    "content": "To formulate your characters using the backward design, simply follow the same format we used for mapping out the plot. Establish where you want your character s development to end"
  },
  {
    "title": "Introducing One Stop for Writers Character Builder",
    "content": "Feb 14, 2019 Create unforgettable characters with depth using this powerful Character Builder at One Stop for Writers. It's unlike any other resource!"
  },
  {
    "title": "Free Writing Tools for Fiction Writers",
    "content": "Oct 16, 2013 These two checklistsone for a quick pass, one for deeper analysishelp you evaluate characters , pacing, tension, and scene goals. Character Creation & Development Tools Backstory Wound Profile (PDF) Map out your character s past wounding event and its aftereffects, so you can write their behavior and struggles in the story."
  },
  {
    "title": "Build These Seven Growth Milestones into Your Character s Arc",
    "content": "These are just a few ways you can show a character s development , and youll need to use many of them throughout the story because evolution is an active process."
  },
  {
    "title": "How Your Characters Failures Can Map A Route To Self-Growth",
    "content": "**Failure is one thing no one looks forward to nor wants to experience.** It doesnt feel good to work at something only to fail. One of the best ways to make a character feel realistic and relatable is to bring human reactions and psychological responses into the story, and failure is a great way to do so naturally. Figuring out how a character will react to failure makes writing the story easier, too. I think characters (and people) probably hit a few of these as they process the failure, and our goal just needs to be to get to the healthier coping strategies a bit quicker each time."
  },
  {
    "title": "The Key Components of a Compelling Character (According to...)",
    "content": "Its a well-known rule that you want to avoid stereotypes and clichs when it comes to character development . Stereotypes and clichs are familiar, commonplace, and banal."
  },
  {
    "title": "100 Common-Sense Ways to Write Better - Writing Forward",
    "content": "Feb 4, 2025 Write every day, even if only for five or ten minutes. Learn your craft, including grammar, spelling, and punctuation. If you want to be a pro, adopt a style guide (and make sure you know what that is and whether your form of writing already has an established style guide). Try to see things from new and different perspectives."
  },
  {
    "title": "How to Improve Your Writing Skills | Writing Forward",
    "content": "Theres a lot to learn, but over time, we learn to write prose and verse that captivates readers. From learning how to comprehensively use tools, like writing software, to mastering concepts"
  },
  {
    "title": "How to Get the Most Out of Your Writing Practice | Writing Forward",
    "content": "You might have a great premise for a story, but if you dont know how to write a storyor if you dont have the discipline to finish a storyyoull never be able to bring that premise to life, at"
  },
  {
    "title": "How to Develop Better Writing Habits | Writing Forward",
    "content": "Writing comes easily to them, but even the most talented writers have to work at the craft. After all, nobodys born knowing how to write ."
  },
  {
    "title": "Writing Forward",
    "content": "Ready, Set, Write : A Guide to Creative Writing takes you on a tour through various forms of writing , tools of the trade, creativity techniques, and practical tips for writing ."
  },
  {
    "title": "36 Tips for Writing Just About Anything | Writing Forward",
    "content": "Depending on how messy your first draft is, you may need to do multiple rewrites. A lot of writers get worn out by this process, but remember your writing improves with each revision."
  },
  {
    "title": "How to Write More - Writing Forward",
    "content": "Mar 27, 2025 Is your creative writing lagging? Do you need to get motivated? These tips will show you how to write more."
  },
  {
    "title": "The Ultimate Guide to Writing Better | Writing Forward",
    "content": "When I wrote 10 Core Practices for Better Writing , I started with a massive list of tips and practices that writers can use to write better. The list was far too long and too detailed."
  },
  {
    "title": "Your Characters Arent Your Children | Writing Forward",
    "content": "Make them selfish or ignorant or weak or arrogant or whatever. Theres no depth in characters that have nothing wrong with them. Flaws also give you scope for character development ."
  },
  {
    "title": "Character-Driven Fiction Writing Prompts - Writing Forward",
    "content": "[Subscribe]( * [About]( * [Story Writing]( * [Writing Prompts]( * [Story Writing]( * [Writing Prompts]( by [Melissa Donovan]( \"Posts by Melissa Donovan\") | Apr 23, 2024 | [Fiction Writing Prompts]( | [13 comments]( [![Image 2: character writing prompts]( * []( * []( * []( * []( * []( [Reply]( [Reply]( [Reply]( [Reply]( [Reply]( [Reply]( * ![Image 10: Melissa Donovan]( [Melissa Donovan]( on December 15, 2011 at 4:09 pm I always imagine character conversations when Im trying to fall asleep. [Reply]( [Reply]( * ![Image 12: Melissa Donovan]( [Melissa Donovan]( on October 28, 2013 at 1:00 pm In most cases, I think its the characters that make stories so compelling. [Reply]( [Reply]( [Reply]( [Reply]( [Reply]( ### Submit a Comment[Cancel reply]( * []("
  },
  {
    "title": "Plot vs. Character in Storytelling - Writing Forward",
    "content": "Sep 14, 2023 Character -Driven Stories Character -driven stories focus on character development , character arcs, and the various struggles and challenges that characters face. Were less interested in the plot unfolding than we are in how the storys events affect the characters ."
  },
  {
    "title": "Writing Forward",
    "content": "Learn to craft characters , plot, setting, and theme, and find out how to apply literary devices and storytelling techniques that take narrative writing to the next level. Pick up Whats the Story? and start developing your storytelling skills today."
  },
  {
    "title": "Character Writing Tips for Fiction Writers | Writing Forward",
    "content": "Character sketches are by no means mandatory. You could also start writing the draft of your manuscript and see how each of these elements develops organically for each character ."
  },
  {
    "title": "Five Things Your Characters Need | Writing Forward",
    "content": "Find out what your characters need. Many writers and readers will agree that the most important element of any story is its characters ."
  },
  {
    "title": "How to Play and Pretend Your Way to Breakthrough... | Writing Forward",
    "content": "I needed to work out my characters plan of action. So I sat there and held a conversation between two characters who were trying to make a joint decision about what to do next."
  },
  {
    "title": "Storytelling Exercise: Character Analysis - Writing Forward",
    "content": "by Melissa Donovan | Dec 19, 2023 | Fiction Writing Exercises | 8 comments This exercise explores one of the most important elements of any story: the characters. Choose a primary character from a story youve read recently (the best characters for this exercise will be complex). Do the characters actions transform the story world? Use the questions above to analyze one of the characters from a story youve written. How can studying characters from various stories help you craft better characters for your stories? My personal view is that characterization always adds depth to any story, but at the same time its possible to have a great story where plot is the most important element and the characters are just along for the ride."
  },
  {
    "title": "Preparing Your Mind for Writing : How to Make the Shift - Writer 's Digest",
    "content": "I teach a workshop called Fearless Writing , which is not a how to write class but a how to get into the frame of mind where writing is possible class."
  },
  {
    "title": "Productivity Hacks to Write Faster Than Ever - Writer's Digest",
    "content": "## Productivity expert Paula Rizzo shares her best strategies for getting the most out of your writing time. How you manage your writing time and where you fit it into your busy schedule will be different for everyone. Being intentional about how you schedule and use your writing time is key. For example, back when I was a full-time news producer, Imade timefor writing after work. Those days are reserved for my writing accountability meetings and solo writing time. When you have your writing time and space figured out (yep, making sure your environment is supporting you with limited distractions is key), return to some of those structured techniques like deadlines, assignments, and Pomodoro."
  },
  {
    "title": "How to Get Started as a Writer - Writer 's Digest",
    "content": "You want to write , but dont know how to begin? Follow these 10 steps to beginning a rewarding, fulfilling career as a writer ."
  },
  {
    "title": "How to Write an Article Archives - Writer 's Digest",
    "content": "Writing Goal The Identity List: How to Catalog Your Written Work to Get More Freelance Writing Projects Kimberly A. Edwards."
  },
  {
    "title": "How to Write in Different Genres - Writer's Digest",
    "content": "May 29, 2025 Emiko Jean and Yulin Kuang share tips and strategies for how they successfully write in different genres and mediums."
  },
  {
    "title": "Six Logical Writing Structures - Writer 's Digest",
    "content": "# Six Logical Writing Structures ## Discover six logical writing structures that can help you find more success with every piece of writing, whether its a query letter, short story, news article, or blog post. Every piece of writing, whether it is a cover letter for a job application, a news article, or a fictional short story, has its own structure. Think of structure as the skeleton of a piece of writing. Or you might use a comparative structure to write a letter to the editor explaining all the reasons you disagree with the city council's decision to raise local taxes. Now that you know about the different kinds of structures, start paying attention to the skeletons of all the pieces of writing around you."
  },
  {
    "title": "How to Improve Your Researching Skills and Write Accurately",
    "content": "In order to grow as professionals, writers should be taught to write what they dont know. Why take on work in this manner? For one, it builds your repertoire."
  },
  {
    "title": "How to Keep Writing When You're Stuck and Your Usual Process ...",
    "content": "Apr 7, 2025 Writing is an evolving practice, so creative roadblocks are inevitable. But when the strategies youve relied on suddenly stop producing results, frustration sets in and doubt can quickly follow close behind. So how do you keep writing when youre stuck and your usual approach isnt working?"
  },
  {
    "title": "9 Dos & Don'ts of Writing What You Know: A Guide to Authentic ...",
    "content": "Feb 10, 2025 Multi-genre author Natali Simmonds shares nine dos and don'ts of writing what you know to write authentic and engaging stories for readers."
  },
  {
    "title": "Learn about the craft of writing with free articles from Scribophile...",
    "content": "Everything You Need to Know About Character Development . Characters are the heart of a story. This guide will show you how to start crafting memorable ones."
  },
  {
    "title": "Write Characters Your Readers Wont Forget - Scribophile",
    "content": "Apr 3, 2023 These character arcs can empower you to ask more strategic questions about your plot, pacing, sequence of scenes, dramatic tension, what clues you provide the reader and when, and about your character s agency, identity, and journey."
  },
  {
    "title": "What Are Character Archetypes? 16 Archetypes, Plus Examples What Are Character Arcs and How to Write Them, with Examples Write Characters Your Readers Wont Forget - Scribophile The Ultimate Guide To Distinctive Character Mannerisms Everything You Need To Know About Character Motivation, and ...",
    "content": "The difference is that while *character archetypes* refer to the individual people that populate the world of your storysuch as heroes, villains, mentors, and others that well look at further below*story archetypes refer to the patterns of events and themes* that drive the story towards its conclusion. Tricksters are perhaps our most enduring character archetype, even more so than heroes. ## How to use character archetypes in your story As we saw above, the antihero is a perfect example of this composite character archetype, fulfilling the role of hero and trickster at the same time. * The Scapegoat Archetype: How to Write a Scapegoat Character (With Examples from Literature)"
  },
  {
    "title": "Character Bio Template for Creating the Perfect Characters",
    "content": "Character development . Your character s desire and thorn should play into your character s arc and development . How will they change over the course of your story?"
  },
  {
    "title": "What Are Character Arcs and How to Write Them, with Examples",
    "content": "Character arcs are fundamental to developing memorable characters . Well tell you all about them, with tips for writing your own."
  },
  {
    "title": "What is a Dynamic Character ? Definition with Examples",
    "content": "Rich character development makes characters dynamic. Vivid character arcs are at the heart of any good story. By using this step-by-step process, you can create dramatic characters that"
  },
  {
    "title": "Everything You Need To Know About Character Motivation, and ...",
    "content": "# Everything You Need To Know About Character Motivation, and How To Find Yours ## What is character motivation in a story? More specific character traits that act as motivations might include ambition, restlessness, creativity and creative validation, guilt, forgiveness, redemption, or a need to understand ones place in the world. When developing your characters motives, spend a moment thinking about sympathetic and empathetic character motivations. While your readers (hopefully) wouldnt commit arson or mass murder in pursuit of their goals, if youve developed your character motivation strongly enough, the reader will at least understand the villain a bit better and where those characters actions have come from. Character motivation is one of the most important elements in developing any good story."
  },
  {
    "title": "What Are Jungian Archetypes, and How They Can Help Develop Your...",
    "content": "Learn about the 12 Jungian archetypes and the 5 Jungian aspects of every character , and how to use them to create more dynamic characters in your story."
  },
  {
    "title": "What Makes a Good Character? Criteria, Tools, and Examples",
    "content": "What makes for a good character ? A good character is one who holds the readers interest from the beginning of a story to the end. This means that theyre three-dimensional, relatable, and believable as human beings. They have clear motivations and goals. Good characters have real flaws, fears, and desires that readers can empathize with and see reflected in themselves."
  },
  {
    "title": "The Ultimate Guide To Distinctive Character Mannerisms",
    "content": "## What are character mannerisms? Character mannerisms are the unconscious gestures, movements, habits, and ways of speaking that make up an individual characters personality. Some examples of character mannerisms might be things like someone using emphatic hand gestures when they speak, running a hand through their hair when theyre nervous, or unconsciously rubbing their nose when theyre lying. ## Types of character mannerisms Speech mannerisms refer to the way a character speaks. ## How to find the right mannerisms for your characters Mannerisms can be a good way to communicate your characters self perception. Overusing your character mannerisms ### Mannerisms of confident characters ### Mannerisms of characters in love ### Mannerisms of curious characters ### Other distinctive character mannerisms"
  },
  {
    "title": "Story Structure as a Fractal",
    "content": "Structure is critical to every story. Let's explore several story structures and their key points to master your plot."
  },
  {
    "title": "The Missing Link in Three-Act Structure",
    "content": "In any discussion of story structure, the three-act model inevitably dominates the conversation. Even as plotting methods such as Save the"
  },
  {
    "title": "Story Not Behaving? Try Going Deeper into Structure",
    "content": "When your story isn't working, look to story structure. Meet readers on the page by showing events or key backstory at the right time."
  },
  {
    "title": "Plot & Structure",
    "content": "Plot and character naturally work together because your story is actually two stories in one: an outer story (plot) and an inner story (character arc)."
  },
  {
    "title": "Structuring an Ensemble Cast with Plotlines",
    "content": "Years ago, I did a post on the different **types of plotlines** in stories: external, internal, relationship, society/world, influence character, and undercurrent. Admittedly, not every character mentioned here gets *three* plotlines, but thats okay, because you only need three different types in the story, not three types for every key character. In the second approach, you start by having different characters share the three dominating plotlines, then go from there. In season one, the dominating plotlines are external, internal, and relationship, but they are split between characters. You could technically write a story where the characters never cross paths, nor fit into a greater plotline, but they each have a journey about the same theme topic ( . Whether you are writing romance, adventure, fantasy, or mystery, nearly every well-told story has a relationship plotline."
  },
  {
    "title": "Digging Deep: The Psychology of a Layered Story",
    "content": "The fireworks stopped, the dog finally fell asleep, and I was so fascinated with reading about the psychology of layering a story with elements of complexity that I did not realize it was Tamar writing this post until I reached the end! 1. [] Jane Friedman looks at how to use context when a story demands more than plot, Janice Hardy talks about making the most of the worst that can happen in your plot, Jami Gold wonders if you can have too many story and character goals, The Writers Ally lays out the best way to use conflict and tension in your narrative, while Jami Gold asks if our stories need more conflict, and Tamar Sloan discusses the psychology of a layered story."
  },
  {
    "title": "How do you actually write a script? : r/Screenwriting - Reddit",
    "content": "Write those down somewhere and keep those in mind. My biggest advice would be, if you have writer's block or you're just staring at a blank page with a blinking cursor, don't panic. Just leave it and come back to it. Most of my ideas on how to make my script move forward came to me in the middle of the night when I'm meant to be asleep."
  },
  {
    "title": "One year of /r/screenwriting - a few tips for beginners - Reddit",
    "content": "READ SCRIPTS The number of people who seem to try and write a screenplay before ever reading one is staggering. So many formatting questions would be answered if every beginner just spent a couple of hours out of their day to read a screenplay end to end. \"How to signify a change in time?\" Read a script where there's a change in time. \"How do you format a super/title?\" Read a script with"
  },
  {
    "title": "How do you start writing? : r/Screenwriting - Reddit",
    "content": "Let yourself write trash because the hardest part of writing is sitting down and actually writing . It doesn't matter how much, how good, how structured, or how anything it is. If you agonize for hours and end up with a single line then congratulate yourself on your writing and do it again tomorrow cuz you did it. \"Its three, three-thirty."
  },
  {
    "title": "Here Are Some Tips on Writing Black Characters as a ... - Reddit",
    "content": "I get asked fairly often by non-Black writers, usually white writers, on how to write realistic Black characters. Usually these aren't science fiction or fantasy scripts, more like grounded dramas or comedies. I figured it might be useful for some people to lay out how to write Black characters if you yourself are not Black. I'm largely going to be speaking on Black American characters but you"
  },
  {
    "title": "Does anyone have any tips on writing a script with little to ...",
    "content": "1.7M Members 92 Online ### Great scripts with minimal dialogue 58 upvotes 59 comments 1.7M Members 92 Online ### Looking for (good) short scripts without dialogue (to study them) 60 upvotes 23 comments 1.7M Members 92 Online ### Screenplays with REALLY good dialogue? 1.7M Members 92 Online ### What's the best dialogue you've read in a screenplay? 1.7M Members 92 Online ### GOOD EXAMPLES OF DUAL DIALOGUE IN A SCRIPT? 1.7M Members 92 Online ### Examples of well written scripts 2 upvotes 14 comments 2.9M Members 46 Online ### Tips for making a short film without any dialogue 3 upvotes 8 comments 3.2M Members 113 Online ### When do I stop writing Dialogue 10 comments"
  },
  {
    "title": "What is the/a standard \"step by step\" process of writing a ...",
    "content": "Write the bare bones of the story in the outline, just enough to lead you to your ending, then do your characters. Once you've got good characters you can then come back to your outline and bend the plot points to fit to your characters natural decisions. 5 - So when doing characters I already have most of them in my head from step 3."
  },
  {
    "title": "Seriously, what is the key to writing great dialogue?",
    "content": "Writing good dialogue is about being able to put yourself into a character and have them react truthfully to the moment without losing sight of the plot or the rest of what's going on."
  },
  {
    "title": "Scribophile: The writing group and online writing workshop ...",
    "content": "# Become a better writer and meet beta readers in our online writing group Helping writers write and get published for **over 17 years!** ## Make your writing shine with feedback from other writers **Scribophile is a writing group focused on getting you feedback on your manuscript.** in fact, were one of the largest online writing groups out there. You can then use that feedback to polish your writing before you take the next step in your publishing journey. **Our writing group welcomes writers of all skill levels** from beginners to published authors, and every writer in between. > Giving and receiving critiques on Scribophile made a big difference to the quality of my writing."
  },
  {
    "title": "Writing Academy - Scribophile",
    "content": "Writing Academy The Scribophile Writing Academy is a free resource to help you learn about the craft of writing , from fundamentals like punctuation and grammar, to craft like points of view and characterization, all the way through submitting manuscripts to agents and publishers. Fundamentals How Long Does It Take to Write a Book? If you want to write a book, you need to plan for how long it"
  },
  {
    "title": "Discuss writing craft in our writing forums | Scribophile",
    "content": "Join in active discussions with thousands of other writers. Get critiques on your work, exchange ideas, learn and improve your writing skills, all in one place."
  },
  {
    "title": "How to Start Writing For the First Time - Scribophile",
    "content": "Getting started writing doesnt have to be intimidating. Well show you how you can start a writing habit today!"
  },
  {
    "title": "What is a Zero Draft? Definition and Tips to Write Your Own",
    "content": "Fija Callaghan is an author, poet, and writing workshop leader. She has been recognized by a number of awards, including being shortlisting for the H. G. Wells Short Story Prize."
  },
  {
    "title": "How to Start Writing a Book",
    "content": "Things to do before writing a book. Learn the craft. Read a lot. Practice your writing skills. How to start writing a book."
  },
  {
    "title": "Creating Memorable Characters - Writer's Digest",
    "content": "Dec 29, 2024 Join author Sharon Short for Character Development : Creating Memorable Characters ! When you take this online writing course, you will learn how to create believable fiction characters and construct scenes with emotional depth and range."
  },
  {
    "title": "The Importance of Character Growth in Fiction - Writer's Digest",
    "content": "# The Importance of Character Growth in Fiction ## Bestselling author Annie Rains shares her thoughts on the importance of character growth in fiction to make compelling stories. If your character is stagnant, there is no story. In order to make the character growth satisfying and believable, show your character doing something that they never would have been able to do at the books start. Prove to your readers that this growth is real and that its making a real difference in your characters life. Readers need to feel the pride and exhilaration of your character finally achieving that goal that seemed so far out of reach at the storys beginning. To conclude, character growth is pinnacle to your story."
  },
  {
    "title": "What is Character Development? | The 9 Ingredients - Writer's ...",
    "content": "Mar 30, 2013 Learn the 9 ingredients of character development . Ask questions like, how does your character talk, what events shaped his personality, what does she look like, and more, to create more interesting and fully developed characters ."
  },
  {
    "title": "20 Ways How to Write Characters Better: Protagonists, Antagonists...",
    "content": "The 9 Ingredients of Character Development , by Tom Pawlik. Learn the 9 ingredients of character development . How to Craft Compelling Characters , by David Corbett."
  },
  {
    "title": "Adding Dimension to Characters: 10 Sly Character Development ...",
    "content": "## These underhanded character development techniques are designed to relax your thinky brain and to draw instead on your curiosity, intuition and slightly devious sense of play in order to help your characters reveal their own inner workings. Dont try to think up something interesting firstjust find your character in a private moment and write everything you see as fast as you can. Set your timer for six minutes, then follow your character anywhere he goescafs, parks, the office, the gymand fire up your X-ray. This is especially helpful in my own writing when I find Ive gone rigid with tension trying to come up with something nuanced yet revealing, lyrical yet natural for my character to say. Simply drop one of the following prompts into your characters unsuspecting subconscious, and write for six minutes as she ruminates furiously."
  },
  {
    "title": "Find Inspiration to Write Your Book With These Tips | NY Book Editors",
    "content": "How to Find Inspiration and Motivation to Write Your Next Book.You dont exactly have writer s block ( writer s block isnt real anyway), but you dont have the motivation to write , either."
  },
  {
    "title": "9 Easy Hacks to Make You a Better Writer | NY Book Editors",
    "content": "Instead, write for 20 or 30 minutes at a time and then take a break. This method is called the Pomodoro Technique, and it does wonders for productivity. How ?"
  },
  {
    "title": "Use These 18 Apps to Improve Your Writing | NY Book Editors",
    "content": "In an effort to improve your writing , check out Twords. Twords is a tracker. You input how many words youd like to write each day, and then Twords will nudge you until you get it done."
  },
  {
    "title": "How to Write a Memoir That People Care About - NY Book Editors",
    "content": "Planning on writing a memoir, but not sure how to go about it or even if you should? Dont worry. You dont have to be famous or infamous to write a memoir that engages an audience and shares a powerful truth about life. You simply need to be willing. The rest is all techniqueand we can help with that. Lets start off by discussing the basics and then well delve into actionable"
  },
  {
    "title": "Daily Writing Exercises Every Writer Needs | NY Book Editors",
    "content": "How to Use Daily Writing Exercises to Level Up as a Writer .Theres only one way to improve as a writer , and thats to write . But what should you write about?"
  },
  {
    "title": "Tips for Writing a Self-Help Book | NY Book Editors",
    "content": "* Services + Editorial Services Then think about the readers motivation. After asking yourself whos going to read your book, think about what questions theyll have about the subject matter. * What could the author improve upon in this book? * How will my book be any different than whats already out there? Your unique take will help you sell your story to an agent, a publisher, and ultimately, an audience. Encourage the reader to start implementing these actions immediately. Ideally, at the end of each chapter, youll give the reader an assignment to complete. Readers are desperate to get unstuck, not to feel good about being stuck. Help your reader understand how everything fits together. Make sure your book isnt a \"long shot\""
  },
  {
    "title": "The Writer's Guide to Humor | NY Book Editors",
    "content": "* Services + Editorial Services Heres a list of 10 things to keep in mind when writing humor. If youd like to capture the dynamic beauty of life in your stories, you should also include humor. From books to blogs to tweets to t-shirts, theres no such thing as a shortage of funny material these days. Other times, its about set up. If youre writing in a rather straight-laced genre, such as horror or thriller, humor can be a disruptive (and unwelcomed) experience. If youre willing to take chances, go for it! * Heighten the tension (especially if only one character is laughing) Heres a list of 10 things to keep in mind when writing humor. How to Write a Thriller Writing a thriller?"
  },
  {
    "title": "Writers Digest Best Writing Advice Websites for Writers 2025",
    "content": "# Writers Digest Best Writing Advice Websites for Writers 2025 Founded by author Gabriela Pereira, DIY MFA seeks to give writers a do-it-yourself alternative to an MFA in writing, offering the knowledge without the college. Through their website, DIY MFA offers courses, online articles, a podcast, and an active community to help create effective writing habits. A mainstay on this list since 2007, Writer Unboxed aims to publish empowering, positive, and provocative ideas about the craft and business of fiction. Guest posts on the site are written by more than 50 bestselling authors and industry experts and cover topics like backstory, writing during challenging times, current publishing issues, and more."
  },
  {
    "title": "Writer's Digest 101 Best Websites for Writers - Writer's Digest",
    "content": "Aug 31, 2025 For the 27 th year, Writers Digest is shining a light on 101 websites with a goal of helping writers in a variety of ways. From getting a boost of creativity when you need it to specific writing advice , from finding an agent to query to pinpointing the trusted resources that weed out scams, this list offers the best places for you to start, no matter your experience level or writing goals"
  },
  {
    "title": "Writing Advice From Fiction Writers - Writer 's Digest",
    "content": "We asked several fiction writers two questions: \"What is the one technique that makes your work stand out?\" and \"What is the best piece of writing advice you ever received?\" Their answers"
  },
  {
    "title": "Writing Advice from Stephen King & Jerry Jenkins - Writer 's Digest",
    "content": "One is arguably the best-known writer of our time. The other made his name writing the end of the world as we know it in the left behind series. If this unique pairing seems unlikely, look"
  },
  {
    "title": "Writing Advice - Writer's Digest",
    "content": "Dec 20, 2019 Writing is a practice, sure, but so is getting dinner together every night, staying on top of the laundry, or making time for some exercise, and I bet you make some semblance of those things happen with reasonable regularity."
  },
  {
    "title": "Essential Writing Advice for Beginners: An Interview With Kerri Majors",
    "content": "I wanted to offer a balance of very practical advice (like how to find a job that will pay your rent and feed your soul, and how to schedule writing into a busy life), and also emotional support"
  },
  {
    "title": "One Piece of Advice From 35 Nonfiction Authors in 2024",
    "content": "Jan 21, 2025 Collected here is one piece of advice for writers from 35 different nonfiction authors featured in our author spotlight series in 2024, including Yasmine Cheyenne, Will Cockrell, Zipora Klein Jacob, Theodore Pappas, Chimene Suleyman, Jerald Walker, and more."
  },
  {
    "title": "Want to Get Published? Start Your Writing Practice Here",
    "content": "The Write Practice is here to kick-start your writing practice. You have to write millions of words no one is ever going to see before you can write the ones that will change someone's life."
  },
  {
    "title": "How to Write Faster: Writing Tips to Finish a First Draft in 6 Weeks",
    "content": "How to Write Fast: The 3 Fast Writing Essentials. Learning anything takes time and that should come as no shock to anyone."
  },
  {
    "title": "How to Write Like a Pro",
    "content": "How can you write a story as good as any professional writer ?However, this is what separates amateur writing from pro writing , this distance. How close can you get?"
  },
  {
    "title": "How to Write a Good First Chapter: A Checklist",
    "content": "How do you write a good first chapter to captivate agents and readers? Use this checklist to master your book's start."
  },
  {
    "title": "The 4 Story Structures that Dominate Novels - Writer's Digest",
    "content": "As you conceive and write your own story, if you realize that what you care about most is having a character explore and discover the world youve created, chances are this structure is your best choice. When writing a milieu story, your beginning point is obviouswhen the character arrivesand the ending is just as plain: when she leaves (or, in a variant, when she decides not to leave, ending the question of going home). ## Structure 3: The Character Story The story begins not at the point when the world becomes disordered, but rather at the point when the character whose actions are most crucial to establishing the new order becomes involved in the struggle."
  },
  {
    "title": "Story Structure: Beginnings, Middles, and Ends - Writer's Digest",
    "content": "Jan 19, 2010 Story Structure: Beginnings, Middles, and Ends Todays guest post is by Jim Adam. It is part of a series on storytelling and The Strengths of the Potter Series. Check out Jims book, Motherless. Structure is the"
  },
  {
    "title": "Story Structure & Writing - Writer's Digest",
    "content": "In today's excerpt from Words Overflown By Stars, author David Jauss discusses and questions the traditional story structure . Theres nothing second-rate about a traditional story ."
  },
  {
    "title": "story structure Archives - Writer's Digest",
    "content": "Build emotion and conflict for your characters and readers by taking a note from the structure of two popular storytelling forms."
  },
  {
    "title": "How Story Structure Mirrors Our Grief Process - Writer's Digest",
    "content": "Many writers are familiar with Joseph Campbells The Heros Journey, and many more are probably familiar with The Five Stages of Grief. When I looked through my own experience writing, I could see that they matched up perfectly, and that in many ways, storytelling is its own grief process that helps us let go of our old selves to accept something new. As writers, we have ideas that wont leave us alone, we follow them into the unknown and face big questions in an epic battle (often bargaining for the story to *work, please, work!*), and ultimately we let our old ways of thinking die so that we can accept a new reality with a newand often more nuancedway of thinking."
  },
  {
    "title": "What are tips for new writers that you would share? : r/writing",
    "content": "Voice: Write. Just keep writing and it will develop naturally. Books: all of the Writers Digest books in the Write Great Fiction and Elements of Fiction Writing series. My tips : Read everything. Write. Practice specific skills with vignettes. Learn to edit your own stuff. Description: Dont bother with it until the next draft."
  },
  {
    "title": "Favorite expert-level writing tips : r/writing - Reddit",
    "content": "But what about Writing 300? Once you've grasped the basics, what are some of r/writing 's favorite high-level tips and tricks--things that are useful in very specific situations, or difficult to pull off, or culled from the deftest bestsellers and award-winners?"
  },
  {
    "title": "Most useful writing tips you've heard? : r/writing - Reddit",
    "content": "213 votes, 117 comments. trueWhat are the most useful writing tips you'd tell people if they asked?"
  },
  {
    "title": "Reddit - The heart of the internet",
    "content": "I know this sounds a bit vague in theory, but I want to really get a sense of what different people in the writing community think is the best possible tip/ piece of advice they would give to a beginner."
  },
  {
    "title": "What is the best writing advice you have ever received?",
    "content": "You cant be a good writer if you arent a good reader is one. The other is to get the words down and focus on fixing them later; writing is rewriting, so get your shitty first draft to paper and you can edit it later."
  },
  {
    "title": "I'm compiling a list of the best writing tips / writing ...",
    "content": "I'm compiling a list of the best writing tips / writing advice compilation for my friend's birthday (because he wants to be a writer); so what are some of the best tips you ever read or received?"
  },
  {
    "title": "I've written over 30 books and want to share some tips",
    "content": "Just to give a little background before I get into my tips : I started writing in 2016 and jumped into the process with self-publishing. Since then, I have been writing on a pace of probably one 45,000 to 65,000 word book every 5 to 6 weeks. I've also been fortunate enough to carve out a really successful career in the process. My first four books made me a combined $7000 or so in the sci-fi"
  },
  {
    "title": "Writing 101: Tips for Choosing the... - WRITERS HELPING WRITERS",
    "content": "# Writing 101: Tips for Choosing the Right Story Details When it comes to writing compelling fiction, choosing the right details can make all the difference. In this *Writing 101* post, were looking at how to use purposeful details in your storytelling so each word earns its place and keeps readers engaged. But **when we dont get the details right, the story itself isnt easy to read**. When your details are too sparse, readers might say something along the lines of Youll need to revisit the passage to either a) trim the details that are cluttering your story, or b) add the details that flesh it out and make it complete. Knowing the passages purpose helps you choose the details that are necessary, with no extraneous words."
  },
  {
    "title": "Struggling with (and Regaining)... - WRITERS HELPING WRITERS",
    "content": "Try these tips and strategies for regaining and maintaining confidence in yourself and in your writing . You've got this!"
  },
  {
    "title": "Five Top Tips To Smash Your... - WRITERS HELPING WRITERS",
    "content": "Lucy, great tips to stay healthy and keep writing our stories. I use AI, chat.openai.com for historical questions."
  },
  {
    "title": "Setting Yourself up for Success... - WRITERS HELPING WRITERS",
    "content": "What do you need to do to write successfully? Here's how to plan your space & get the resources you need to start and finish your book."
  },
  {
    "title": "Resources and Strategies for Neurodivergent Writers",
    "content": "Aug 5, 2025 My last post highlighted Writing Tips for the Neurodivergent Brain, but what about writing resources and tools? What sorts of helpers are out there to help people with not-so-great executive functions get to the end? What the Heck Is Executive Function? This is the part of the brain that manages tasks, time, focus, and self-control."
  },
  {
    "title": "Writing 101: Avoiding the Most Common Dialogue Mechanics ...",
    "content": "Mar 27, 2025 Struggling with dialogue mechanics? Learn the biggest mistakes writers make & how to fix them, from punctuation to paragraphing and thoughts."
  },
  {
    "title": "Moving to Hollywood/LA, looking for advice : r/Screenwriting",
    "content": "If anyone has any helpful advice as a fellow writer, or can tell me about the different neighborhoods of LA and where is best for writers to reside, it would be super helpful. You should take a look at the moving to LA megathreads that are a part of r /asklosangeles and r /movingtolosangeles. The best place to start is here."
  },
  {
    "title": "r/Screenwriting - Reddit",
    "content": "Join our community of over 1,700,000 Screenwriters! From beginners to professionals, we come together to teach, learn, and share everything about screenwriting for film and television. Please view our rules and wikis before posting. Scroll down for resources, mod and verification applications, and more."
  },
  {
    "title": "My Personal Best Advice for New/Emerging writers - Reddit",
    "content": "My best advice is to find peers to give you feedback, so you can pay them back in-kind with you reading their work. That's how I did it, and how most of my friends progressed, too. With social media as it is now, you can find writers at your same level who are just as serious about writing as you are, and collectively rise together."
  },
  {
    "title": "How the hell do you write a short film? : r/Screenwriting",
    "content": "I disagree with the advice to think of a short as a 'joke format'. That's a recipe for a boring and predictable film - or maybe a decent little film but you wont break new ground. Short films can absolutely be compelling and explore deep ideas, strong characters and big events. They absolutely can have a 3 act structure."
  },
  {
    "title": "Whats the best screenwriting advice youve ever gotten?",
    "content": "If that is the advice , I agree, but dont make it sound like if you havent experienced grief, you cant write grief effectively. What would a young writer do to experience grief? How interesting does his life have to be for him to experience the grief of entering a black hole?"
  },
  {
    "title": "The most important screenwriting advice youve ever received?",
    "content": "Whats the most important screenwriting advice youve ever received this can be comments from a contest reader, a friend/family member, a filmmaker, etc."
  },
  {
    "title": "Is one evaluation good enough for the Blacklist? : r ... - Reddit",
    "content": "I contacted customer service to get advice on the next steps in uploading a cleaner version and clarify the impact the score would have on my chances. The person who helped me answered all of my questions. I'm going to upload another draft soon because I want to apply for another lab. Putting yourself out there is part of the process."
  },
  {
    "title": "5 Tips for Writing Better and Faster - Writer 's Digest",
    "content": "Career freelance writer Robert W. Bly shares his top five tips for writing better and faster, regardless of genre or format."
  },
  {
    "title": "How to Improve Writing Skills Archives - Writer's Digest",
    "content": "How to Improve Writing Skills Writing Techniques 100 Ways to Buff Your Book Elizabeth Sims Write Better Nonfiction Polishing Your Prose: Tips for Self-Editing Estelle Erasmus Writing Genres Vintage WD: Decoding the Secrets to Selling Popular Fiction, Part 2 Amy Jones Writing Articles Becoming a Multigenre Writing Master Simon Van Booy"
  },
  {
    "title": "Writing Academy",
    "content": "A free resource to help you learn about the craft of writing, from fundamentals like punctuation and grammar, to craft like points of view and characterization."
  },
  {
    "title": "Mastering Show, Don't Tell - Writing classes",
    "content": "Show, don't tell is far and away one of the most common pieces of writing advice. You've probably heard it a hundred times by now!"
  },
  {
    "title": "Writing Effective Dialogue: Advanced Techniques",
    "content": "Its only through writing great dialogue that the writer tells us *who* a character is. The earliest advice most writers get is write what you know. This may explain why learning to write dialogue is so difficult: we naturally learn how to speak to others, but we dont naturally learn how characters should communicate in a well-crafted story. When youre writing first-person internal dialogue, make sure that its consistent with the characters previous characterization and motivation. To avoid constantly writing I said and I felt, youll need to convey to the reader how characters feel by expressing it in the dialogue. ## Writing dialogue between characters ### Dialogue between two characters ### Dialogue between more than two characters"
  },
  {
    "title": "How to Start a Short Story",
    "content": "Discover practical tips for starting your short story effectively and capturing your reader's attention in this detailed guide."
  },
  {
    "title": "How to Start Writing For the First Time",
    "content": "Join a writing group. When you're ready, try connecting with other writers. A writing group can give you accountability, support, advice, and ideas."
  },
  {
    "title": "Write About What You Know",
    "content": "Write what you know means write with authenticity about thoughts, feelings, experiences of life."
  },
  {
    "title": "What is the Threshold Guardian Archetype? With Tips for ...",
    "content": "Learn what the Threshold Guardian character archetype is, along with tips on how to write your own effective guardian archetypes."
  },
  {
    "title": "30+ Types of Characters in a Story: The Ultimate Guide to ...",
    "content": "Events happen because your protagonist, antagonist, and supporting players (more on all of these character types below!) make choicesactions and reactions that power the story forward. ## How many characters should a story have? The protagonist is the main character of a story. A stock character is a character that fills a predetermined role in an archetypal story. We often refer to a main character as the hero of their story, but when looking at character and story archetypes, a hero is a specific type of headliner. The mother archetype is a character who plays a caring, maternal role in a story. The scapegoat archetype is a character who takes the suspicion or blame for events happening in the story. This archetype can fill the roles of other characters, too."
  },
  {
    "title": "How to Write a Novel: A High-Level Introduction for New... | Scribophile",
    "content": "Youll take part in an energizing writing exercise that will show you how to tap into your subconscious and life experiences to transform them into a book-length project"
  },
  {
    "title": "How to Start Writing a Book - Scribophile",
    "content": "Getting started can sometimes be the hardest part of writing . Learn how to get your first few chapters started in this useful guide."
  },
  {
    "title": "The Help Center | Scribophile",
    "content": "Read about how to get around the site. Learn about your personal profile and your scratchpad. Make some friends in the forums. Whats karma, how much do you need, and how do you get it?"
  },
  {
    "title": "How to Start Writing For the First Time",
    "content": "Start smallsomething like setting a timer for 15 minutes of uninterrupted writing , or writing 200 words. Then, decide how often youre going to pursue this goal. Every day?"
  },
  {
    "title": "Whose Writing Advice Should You Follow?",
    "content": "Some writing experts say, Write what you know. Others say, Make it up as you go. Some say, Write by the seat of your pants."
  },
  {
    "title": "The Only Two Writing Tips You'll Ever Need: Read and Write",
    "content": "One of the most common pieces of advice for writers is this: carry a notebook with you at all times. You can also use your smart phone or a"
  },
  {
    "title": "15 Quick and Dirty Writing Tips",
    "content": "Read as much as you can (and make sure you read good stuff). Write every day practice makes perfect."
  },
  {
    "title": "Writing Tips: Write What You Know",
    "content": "Write what matters to you. It goes without saying that your work must matter to you. Write about what moves you, stirs your passion, fills you"
  },
  {
    "title": "The 22 Best Writing Tips Ever",
    "content": "Some writing tips: Writers always need to be true to themselves. Write down everything. Know your proofreading marks. Take a college level or"
  },
  {
    "title": "The Ultimate Guide to Writing Better",
    "content": "This guide to writing better offers resources, techniques, and practices to help you consistently strengthen your craft."
  },
  {
    "title": "100 Common-Sense Ways to Write Better",
    "content": "Watch your rhythm. Vary the lengths of your words and sentences. Make sure your writing is properly paced. Master the art of formatting"
  },
  {
    "title": "36 Tips for Writing Just About Anything",
    "content": "Writing well takes years of study, practice, and experience. It requires diligence, attention to detail, and dedication to the craft."
  },
  {
    "title": "Writing Tips: Be Yourself",
    "content": "When it comes to writing, should you be yourself, or should you study and practice to become better? Maybe a mix of both is the best option."
  },
  {
    "title": "Ten Grammar Rules Every Writer Should Know",
    "content": "The best writing follows the rules of grammar (or breaks those rules only with good reason) and is clear, coherent, and consistent."
  },
  {
    "title": "Tips for writing a first draft : r/writing - Reddit",
    "content": "A great many how-to- write books and blogs (written by well-meaning writers) attempt to instruct new writers on perfecting a great many writing ideologies, at a time when a new writer's brain is already overloaded with WTF? When one's been writing long enough, certain patterns begin to emerge about the best methodologies to followbut until that time, these books will only confound you. This"
  },
  {
    "title": "How To Write Beautiful Prose : r/writing - Reddit",
    "content": "The information about all of these things can be easily found on the internet and is worth some of your writing time to consider and learn these. Being very comfortable with how these all work is a necessary precursor to being able to write beautiful prose."
  },
  {
    "title": "Writing - Reddit",
    "content": "r/ writing : Discussions about the writing craft.I know this has been said a million times on this sub, but I can't stress this enough; listen to your writing in audio format. Your eyes might decive you but your ears will not. Your eyes, which have edited, re-edited, cleaned up, polished and milled over your writing , by default, is going to be a little tired of reading the same thing over and"
  },
  {
    "title": "What is the best writing advice you have ever received? - Reddit",
    "content": "Idk what the advice I've gotten, but one of the most important things I've come across in writing is pacing. Most writers don't fully understand what it means to pace your book."
  },
  {
    "title": "Writing - Reddit",
    "content": "Advice about Fantasy story formatting Im currently writing a first draft for a story, is it a good idea to format a story almost in an episodic way? Like This: Chapter 1-3: Setting up the MC, showing earth and how he gets to the other dimension. Chapter 4-7~9: First exploration with the new family. First adventure together."
  },
  {
    "title": "Favorite expert-level writing tips : r/writing - Reddit",
    "content": "But what about Writing 300? Once you've grasped the basics, what are some of r / writing 's favorite high-level tips and tricks--things that are useful in very specific situations, or difficult to pull off, or culled from the deftest bestsellers and award-winners?"
  },
  {
    "title": "Reddit - The heart of the internet",
    "content": "I know this sounds a bit vague in theory, but I want to really get a sense of what different people in the writing community think is the best possible tip/ piece of advice they would give to a beginner. I think it would be really interesting to see all the different points of view and maybe learn something from each other."
  },
  {
    "title": "I've written over 30 books and want to share some tips",
    "content": "I think that's the majority of the general advice I had to share. I really just enjoy talking about writing stuff, which is why I make posts like this. So if you have any questions/comments, please chime in and I'll respond to all of them (probably in more depth than you want)."
  },
  {
    "title": "One year of /r/screenwriting - a few tips for beginners - Reddit",
    "content": "I started screenwriting 15 months ago, and have been a frequent of this r/screenwriting throughout. I'm completely self taught, so the feedback and advice I've been given here has been invaluable. I cannot thank you all enough. Over my time here, I have noticed a number of mistakes and questions that often come up from beginners, so I thought I'd make a post giving some general tips . None of"
  },
  {
    "title": "Seriously, what is the key to writing great dialogue?",
    "content": "Seriously, what is the key to writing great dialogue? Skip to main contentSeriously, what is the key to writing great dialogue? Image 1: r/Screenwriting icon Go to Screenwriting Image 3: r/Screenwriting iconr/Screenwriting Seriously, what is the key to writing great dialogue? It doesn't have that GRIPPING factor that I want, ya know, it just kinda gets the job done- which isn't good considering the screenplay I'm writing is a drama and almost entirely driven by dialogue. Techniques for writing gripping dialogue Tips for improving dialogue writing skills Format for writing dialogue in screenplays Top Posts * Reddit reReddit: Top posts of September 1, 2022 * * * * Reddit reReddit: Top posts of September 2022 * * * * Reddit reReddit: Top posts of 2022 * * *"
  },
  {
    "title": "Best way to learn how to actually screenwrite? : r/Screenwriting",
    "content": "A general writing group or class is great, too, but again, screenplay style is unique, so it's not going to d a whole lot of good, necessarily, to have a beat poet read your horror movie, for example. You need feedback specific to screenplays. Write write write write write write."
  },
  {
    "title": "Whats the best screenwriting advice youve ever gotten?",
    "content": "As an aspiring professional, it's basically the same deal -- it's just that the deadline is whenever you stop writing today, and the boss is the slightly better writer Future You. And maybe tomorrow's Future You isn't THAT much better. That's fine. Just keep writing stuff, keep pushing to the end."
  },
  {
    "title": "As a pro what are your best advice for beginners? : r ...",
    "content": "Start by writing . Attend creative writing classes, watch writing youtube channels, but most of all, write. Forget about being a pro or what pros do, just write for now. You're 15."
  }
]